This is just a example I'm using localstack and creating a basic SQS
The pretty output:
```
  + resource "aws_sqs_queue" "terraform_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 90
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 86400
      + name                              = "terraform-example-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + tags                              = {
          + "custom1" = "meat"
          + "custom2" = "potato"
        }
      + tags_all                          = {
          + "custom1" = "meat"
          + "custom2" = "potato"
          + "tag1"    = "popcorn"
          + "tag2"    = "bacon"
          + "tag3"    = "cheese"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }
```
This is what happen when I execute the tf_compliance:
```
terraform-compliance v1.3.32 initiated
. Converting terraform plan file.
> Features      : ~/doc/lab-terraform-compliance/
> Plan File     : ~/doc/lab-terraform-compliance/plan.out.json

> Running tests. 

Feature: Governance and Cost Compliance Check  # ~/doc/lab-terraform-compliance/governance.feature

    Scenario Outline: Ensure that specific tags are defined in resources
        Given I have resource that supports tags defined
        When it has tags
        Then it must contain tags
        Then it must contain "<tags>"
        And its value must not be null

    Examples:
        | tags |
                Failure: aws_sqs_queue.terraform_queue (resource that supports tags) does not have tag1 property.
        | tag1 |
          Failure: 
                Failure: aws_sqs_queue.terraform_queue (resource that supports tags) does not have tag2 property.
        | tag2 |
          Failure: 
                Failure: aws_sqs_queue.terraform_queue (resource that supports tags) does not have tag3 property.
        | tag3 |
          Failure: 

    Scenario Outline: Ensure that specific tags are defined in providers default tags
        Given I have resource that supports tags_all defined
        When it has tags_all
        Then it must contain tags_all
        Then it must contain "<tags>"
        And its value must not be null

    Examples:
        | tags |
        | tag1 |
        | tag2 |
        | tag3 |

1 features (0 passed, 1 failed)
6 scenarios (3 passed, 3 failed)
30 steps (24 passed, 3 failed, 3 skipped)
Run 1647970914 finished within a moment
```

